---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.MeshTopologicalSortFailed
source: html/a5b260de-5dfb-a79e-8d81-41fa977ab014.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.MeshTopologicalSortFailed Property

Splitters and grids do not define a consistent rectangular mesh on the face.

## Syntax (C#)
```csharp
public static FailureDefinitionId MeshTopologicalSortFailed { get; }
```